In [2]:
import pandas as pd

In [1]:
import numpy as np

In [3]:
df=pd.DataFrame(data=np.random.randint(0,100,(4,3)),columns=['Test1','Test2','Test3'],index=['Vinay','Vinaett','suraj','anil'])

In [4]:
dfdf

         Test1  Test2  Test3
Vinay       68     93     30
Vinaett     97     15     43
suraj       70      1     34
anil        22     29     53

In [5]:
df.where(df.Test1<80,'A+')

        Test1 Test2 Test3
Vinay      68    93    30
Vinaett    A+    A+    A+
suraj      70     1    34
anil       22    29    53

In [6]:
df.where(df<80,"A+")

        Test1 Test2  Test3
Vinay      68    A+     30
Vinaett    A+    15     43
suraj      70     1     34
anil       22    29     53

In [7]:
df2=pd.DataFrame(data=np.random.randint(0,100,(4,3)),columns=['Test1','Test2','Test3'],index=['Vinay','Vinaett','suraj','anil'])

In [11]:
df2

         Test1  Test2  Test3
Vinay       59     45     45
Vinaett      5     77     21
suraj       42      9     98
anil         0     92      5

In [12]:
df.where(df<70,df2)

         Test1  Test2  Test3
Vinay       68     45     30
Vinaett      5     15     43
suraj       42      1     34
anil        22     29     53